# Кажется, в задаче просят написать программу, которая будет принимать две строки
# И строки могут быть любые, а не жёстко зашитые в программе
# Тут стандартная ошибка хардкод (почитай в инете)
a1 = 'In a hole in the ground there lived a hobbit.'
substring1 = 'hole in the ground'
print (substring1 in a1)
